app/views/recipes/_recipe_bricks.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
              Submitted by
              <% if recipe.user.name.blank? %>