app/views/recipes/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
          <div class="btn pull-right">
            <% if @recipe.user.favorites.include?(@recipe) %>

SELECT "allergens".* FROM "allergens" INNER JOIN "recipe_allergens" ON "allergens"."id" = "recipe_allergens"."allergen_id" WHERE "recipe_allergens"."recipe_id" = ?  [["recipe_id", 1]]
---
        <h3>Allergens avoiding</h3>
        <% @recipe.allergens.each do |allergen| %>

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 1]]
---
        <ol>
          <% @recipe.ingredients.each do |ingredient| %>