app/controllers/recipes_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "recipes".* FROM "recipes"
---
  def index
    if  params[:user_id]
      @user = User.find_by(id: params[:user_id])
      if @user.nil?
        flash[:warning] = "User not found."
        redirect_to users_path
      else
        @recipes = @user.recipes
        @favorite_user_recipe = Recipe.favorite_user_recipe.take

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ? AND "recipes"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
  def show
    if params[:user_id]
      @user = User.find_by(id: params[:user_id])
      # Filter for a recipe by the user
      @recipe = @user.recipes.find_by(id: params[:id])

INSERT INTO "recipes" ("title", "description", "instruction", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = current_user.recipes.build(recipe_params)
    if @recipe.save